//==========================================
//
// File: EnemyState.cpp
//
// エネミー状態遷移 ヘッダーファイル
//
// 2017/05/15
//						Author Shinya Ueba
//==========================================

//==========================================
// ヘッダインクルード
//==========================================
#include "EnemyState.h"

//==========================================
//
// Class: CEnemyState
//
// エネミー 状態 基底クラス
//
// 2017/05/15
//						Author Shinya Ueba
//==========================================
#include "Model\Character\HenchmanTypeAEnemy.h"


//EOF